app/controllers/admin/categories_controller.rb

SELECT "categories".* FROM "categories"   ORDER BY name
---
  def index
    @categories = Category.find_all_top_level.order("name")

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-06-09 19:48:50.197910"], ["name", "Foo"], ["updated_at", "2014-06-09 19:48:50.197910"]]
---
  def create
    @category = Category.new(category_params)
    @top_level_categories = Category.find_all_top_level
    respond_to do |format|
      if @category.save