app/controllers/admin/items_controller.rb

  def new
    @item = Item.new
    @shapes = Shape.all.order("name")
    @categories = Category.all.order("name")
---
SELECT "categories".* FROM "categories"   ORDER BY name

  def edit
    @shapes = Shape.all.order("name")
    @categories = Category.all.order("name")
---
SELECT "shapes".* FROM "shapes"   ORDER BY name
SELECT "categories".* FROM "categories"   ORDER BY name

  def create
    @item = Item.new(item_params)
    @categories = Category.all.order("name")
    @shapes = Shape.all.order("name")
    respond_to do |format|
      if @item.save
---
SELECT "categories".* FROM "categories"   ORDER BY name
INSERT INTO "items" ("body", "created_at", "name", "preview", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "sdfs<u>dfsdfsfsf</u> <br>"], ["created_at", "2014-06-10 18:15:11.171589"], ["name", ""], ["preview", ""], ["updated_at", "2014-06-10 18:15:11.171589"]]

  def update
    @categories = Category.all.order("name")
    @shapes = Shape.all.order("name")
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "image" = ?, "updated_at" = ? WHERE "items"."id" = 2  [["image", "scary_real_calvin_and_hobbes.jpg"], ["updated_at", "2014-06-10 21:04:46.414987"]]