app/controllers/admin/items_controller.rb

  def new
    @item = Item.new
    @categories = Category.find_all_nested
---
SELECT "categories".* FROM "categories"