app/controllers/admin/users_controller.rb

INSERT INTO "users" ("created_at", "email", "hashed_password", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save

UPDATE "users" SET "hashed_password" = ?, "updated_at" = ? WHERE "users"."id" = 5  [["hashed_password", "$2a$10$1c1eqGJlKiK6JfvEX48BTOxD0sRhHYf9bynNLSlrWJXQk8wPsW1ky"], ["updated_at", "2014-06-09 20:23:03.140998"]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)