app/views/admin/categories/index.html.erb

SELECT "categories".* FROM "categories"   ORDER BY name
---
      </tr>
			<% category.categories.each do |subcat| %>