app/controllers/items_controller.rb

SELECT "categories".* FROM "categories"
---
  def new
    @item = Item.new
    @categories = Category.all

INSERT INTO "items" ("body", "created_at", "name", "preview", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)
    @categories = Category.all
    respond_to do |format|
      if @item.save