app/controllers/pages_controller.rb

SELECT "categories".* FROM "categories"
SELECT "items".* FROM "items"   ORDER BY RANDOM()
---
  def main
    @categories = Category.all
    @items = Item.all.order("RANDOM()")