app/controllers/sessions_controller.rb

  def create
    if User.authenticate(params[:email], params[:password])
      session[:user_id] = User.find_by_email(params[:email]).id
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'admin@movingstories.ca' LIMIT 1